#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ ЕРП ЗИК

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_ЛистокСообщения2025";
	КомандаПечати.Представление = НСтр("ru='Листок сообщения';uk='Листок повідомлення'");
	КомандаПечати.МестоРазмещения = "ЛистокСообщенияДляВоенкоматаКонтекстноеМеню";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_ЛистокСообщения2023";
	КомандаПечати.Представление = НСтр("ru='Листок сообщения (до 2025 г.)';uk='Листок повідомлення (до 2025 р.)'");
	КомандаПечати.МестоРазмещения = "ЛистокСообщенияДляВоенкоматаКонтекстноеМеню";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_ЛистокСообщения";
	КомандаПечати.Представление = НСтр("ru='Листок сообщения (до 2023 г.)';uk='Листок повідомлення (до 2023 р.)'");
	КомандаПечати.МестоРазмещения = "ЛистокСообщенияДляВоенкоматаКонтекстноеМеню";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Список";
	КомандаПечати.Представление = НСтр("ru='Список для бронирования';uk='Список для бронювання'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.МестоРазмещения = "БронированиеГражданПребывающихВЗапасеКонтекстноеМеню";

	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ТипЗнч(МассивОбъектов[0].Ссылка) = Тип("ДокументСсылка.ЛистокСообщенияДляВоенкомата") Тогда
		
		Документы.ЛистокСообщенияДляВоенкомата.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	ИначеЕсли ТипЗнч(МассивОбъектов[0].Ссылка) = Тип("ДокументСсылка.БронированиеГражданПребывающихВЗапасе") Тогда
		
		Документы.БронированиеГражданПребывающихВЗапасе.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	КонецЕсли;
	
КонецПроцедуры

//-- ЕРП ЗИК

#КонецЕсли