#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СреднесписочнаяЧисленность");
	НастройкиВарианта.Описание = НСтр("ru='Среднесписочная, списочная численность и количество приемов и 
                                            |увольнений по подразделениям'
                                            |;uk='Середньоспискова, спискова чисельність і кількість прийомів і 
                                            |звільнень по підрозділах'"); 
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СреднесписочнаяЧисленностьЭПЗ");
	НастройкиВарианта.Описание = НСтр("ru='Среднее количество сотрудников в эквиваленте полной занятости';uk='Середня кількість співробітників в еквіваленті повної зайнятості'");

КонецПроцедуры

#КонецОбласти

#КонецЕсли