#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИнициализироватьОтчет();
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();     
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	Если КлючВарианта = "СреднесписочнаяЧисленность" Тогда
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьГигКонтракты") Тогда
			ЗаголовокГруппы = НСтр("ru='Среднесписочная численность';uk='Середня за списком чисельність'");
			
			Для Каждого Группа из НастройкиОтчета.Выбор.Элементы Цикл 
				Если ВРЕГ(Строка(Группа.Заголовок)) = ВРЕГ(ЗаголовокГруппы) Тогда  
					Для Каждого ЭлементГруппы Из Группа.Элементы Цикл  
						Если ВРЕГ(Строка(ЭлементГруппы.Поле)) = "СРЕДНЕСПИСОЧНАЯЧИСЛЕННОСТЬРАБОТНИКОВПОГИГКОНТРАКТУ" Тогда
							ЭлементГруппы.Использование = Ложь;
							Прервать;
						КонецЕсли	
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		
		ПараметрИсключатьПериодыПоПравилам1ПВ = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьПериодыПоПравилам1ПВ"));
		Если ПараметрИсключатьПериодыПоПравилам1ПВ.Значение = ЛОЖЬ  Тогда
			
			ЗаголовокГруппы = НСтр("ru='Неучитываемые периоды';uk='Невраховані періоди'");
			
			Для Каждого Группа из НастройкиОтчета.Выбор.Элементы Цикл 
				Если ВРЕГ(Строка(Группа.Заголовок)) = ВРЕГ(ЗаголовокГруппы) Тогда  
					Для Каждого ЭлементГруппы Из Группа.Элементы Цикл  
						Если ВРЕГ(Строка(ЭлементГруппы.Поле)) = "МОБИЛИЗАЦИЯ" 
							ИЛИ ВРЕГ(Строка(ЭлементГруппы.Поле)) = "МОБИЛИЗАЦИЯБЕЗОПЛАТЫ" 
							ИЛИ ВРЕГ(Строка(ЭлементГруппы.Поле)) = "ПРИОСТАНОВКАТРУДОВОГОДОГОВОРА"  
							ИЛИ ВРЕГ(Строка(ЭлементГруппы.Поле)) = "ОТПУСКНЕОПЛАЧИВАЕМЫЙНАВРЕМЯВОЕННОГОПОЛОЖЕНИЯ"
							Тогда
							ЭлементГруппы.Использование = Ложь;
						КонецЕсли	
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	 
		КонецЕсли;
		
		СтандартнаяОбработка = ложь;
		
		ДокументРезультат.Очистить();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);      
	Иначе      
		СтандартнаяОбработка = Ложь;
		
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СреднесписочнаяЧисленностьСотрудниковЭПЗ";
		ДокументРезультат.АвтоМасштаб = Истина;
      	ДокументРезультат.ОтображатьГруппировки = Истина;
		ДокументРезультат.ОтображатьЗаголовки   = Истина;

		ЗначениеПараметраПериодОтчета = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
		Если ЗначениеПараметраПериодОтчета <> Неопределено Тогда
			ЗначениеПараметраПериодОтчета.Значение.ДатаНачала = НачалоМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаНачала);
			ЗначениеПараметраПериодОтчета.Значение.ДатаОкончания = КонецМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаОкончания);
			ЗначениеПараметраНачалоПериода = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
			ЗначениеПараметраНачалоПериода.Значение = НачалоМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаНачала);
			ЗначениеПараметраКонецПериода = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		    ЗначениеПараметраКонецПериода.Значение = КонецМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаОкончания)
		КонецЕсли;	
		ПараметрИсключатьТяжелыеУсловияТруда = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьТяжелыеУсловияТруда"));   
		ИсключатьТяжелыеУсловияТруда = ПараметрИсключатьТяжелыеУсловияТруда.Значение;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать (МакетКомпоновки, , , Истина);
			
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		Данные =  Новый ДеревоЗначений;
		ПроцессорВывода.УстановитьОбъект(Данные);
			
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);    
  		ДатаНачала = НачалоМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаНачала);
		ДатаОкончания = НачалоМесяца(ЗначениеПараметраПериодОтчета.Значение.ДатаОкончания);

		СформироватьМакет(ДокументРезультат, Данные, ДатаНачала, ДатаОкончания, ИсключатьТяжелыеУсловияТруда)   
		
	КонецЕсли;      
КонецПроцедуры

Процедура СформироватьМакет(ДокументРезультат, Данные, ДатаНачала, ДатаОкончания, ИсключатьТяжелыеУсловияТруда) 
	
	// Области макета
	Макет =	УправлениеПечатью.МакетПечатнойФормы("Отчет.СтатистикаПерсонала.ПФ_MXL_МакетСреднесписочнаяЧисленностьЭПЗ"); 

	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьОрганизация = Макет.ПолучитьОбласть("ОбластьОрганизация");
	ОбластьЭПЗСовместители = Макет.ПолучитьОбласть("ОбластьЭПЗСовместители");
	ОбластьЭПЗСовместителиЗаголовок = Макет.ПолучитьОбласть("ОбластьЭПЗСовместителиЗаголовок");
	ОбластьЭПЗСовместителиИтог = Макет.ПолучитьОбласть("ОбластьЭПЗСовместителиИтог");
    ОбластьЭПЗОсновные = Макет.ПолучитьОбласть("ОбластьЭПЗОсновные");
    ОбластьЭПЗОсновныеЗаголовок = Макет.ПолучитьОбласть("ОбластьЭПЗОсновныеЗаголовок");
	ОбластьЭПЗОсновныеИтог = Макет.ПолучитьОбласть("ОбластьЭПЗОсновныеИтог");
    ОбластьЭПЗВнутренние = Макет.ПолучитьОбласть("ОбластьЭПЗВнутренние"); 
    ОбластьЭПЗВнутренниеЗаголовок = Макет.ПолучитьОбласть("ОбластьЭПЗВнутренниеЗаголовок"); 
    ОбластьЭПЗВнутренниеИтог = Макет.ПолучитьОбласть("ОбластьЭПЗВнутренниеИтог"); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));   
	ТаблицаДанных.Колонки.Добавить("ВидЗанятости", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗанятости"));
	
	ТаблицаИтоговыхДанных = Новый ТаблицаЗначений;
	ТаблицаИтоговыхДанных.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));      
	ТаблицаИтоговыхДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100))); 
	ТаблицаИтоговыхДанных.Колонки.Добавить("ВидЗанятости", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗанятости")); 
	ТаблицаИтоговыхДанных.Колонки.Добавить("Норма", Новый ОписаниеТипов("Число"));      
	ТаблицаИтоговыхДанных.Колонки.Добавить("Работа", Новый ОписаниеТипов("Число")); 
	ТаблицаИтоговыхДанных.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата")); 
	ТаблицаИтоговыхДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ДокументРезультат.Вывести(Заголовок); 
	
	ПериодОтчета = ""; 
   	Если НачалоМесяца(ДатаНачала) = НачалоМесяца(ДатаОкончания) Тогда
    	ПериодОтчета = Формат(ДатаНачала, "ДФ='ММММ гггг'")
	Иначе 
		ПериодОтчета = Формат(ДатаНачала, "ДФ='ММММ гггг'") + " - " + Формат(ДатаОкончания, "ДФ='ММММ гггг'")
	КонецЕсли;


	Для Каждого СтрокаОрганизации Из Данные.Строки Цикл
		Организация = СтрокаОрганизации.Организация;
		Для Каждого СтрокаМесяца Из СтрокаОрганизации.Строки Цикл 
			Месяц = СтрокаМесяца.Месяц;    
			Для Каждого СтрокаСотрудника Из СтрокаМесяца.Строки Цикл  
				Если ИсключатьТяжелыеУсловияТруда
					И СтрокаСотрудника.ДолжностьТяжелыеУсловияТруда = ИСТИНА Тогда  
					Продолжить
				Иначе
					НоваяСтрока = ТаблицаДанных.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСотрудника);
				КонецЕсли;	
			КонецЦикла;	                                            
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.Совместительство);
			
			МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
			ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
			ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
			Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл     
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				НоваяСтрока.Наименование = СтрокаДанных.Сотрудник.Наименование;
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;
				НоваяСтрока.Месяц = Месяц; 
				НоваяСтрока.Организация = Организация; 
			КонецЦикла;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
			
			МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
			ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
			ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
			Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл     
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				НоваяСтрока.Наименование = СтрокаДанных.Сотрудник.Наименование;
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы;
				НоваяСтрока.Месяц = Месяц; 
				НоваяСтрока.Организация = Организация; 
			КонецЦикла;   
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.ВнутреннееСовместительство);
			
			МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
			ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
			ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
			Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл     
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);  
				НоваяСтрока.Наименование = СтрокаДанных.Сотрудник.Наименование;
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство;
				НоваяСтрока.Месяц = Месяц; 
				НоваяСтрока.Организация = Организация; 
			КонецЦикла;   
		КонецЦикла;
	КонецЦикла;	  
	
	Запрос.УстановитьПараметр("ТаблицаИтоговыхДанных", ТаблицаИтоговыхДанных);
	Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник,
		|	ТаблицаИтоговыхДанных.Наименование КАК Наименование,
		|	ТаблицаИтоговыхДанных.Организация КАК Организация,    
		|	ТаблицаИтоговыхДанных.Месяц КАК Месяц,   
		|	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,   
		|	ТаблицаИтоговыхДанных.Норма КАК Норма,   
       	|	ТаблицаИтоговыхДанных.Работа КАК Работа
       	|ПОМЕСТИТЬ ВТТаблицаИтоговыхДанных 
		|ИЗ &ТаблицаИтоговыхДанных КАК ТаблицаИтоговыхДанных
		|";
	Запрос.Выполнить();
	
	Для Каждого СтрокаОрганизации Из Данные.Строки Цикл   
		Средняя = 0; Норма = 0 ; Работа = 0;
		Организация = СтрокаОрганизации.Организация;
		ОбластьОрганизация.Параметры.Организация = Организация;  
		
		ОбластьОрганизация.Параметры.ПериодОтчета = "За " + ПериодОтчета;

		ДокументРезультат.Вывести(ОбластьОрганизация);

        ДокументРезультат.Вывести(ОбластьЭПЗСовместителиЗаголовок);
		Запрос.УстановитьПараметр("ВидЗанятости", Перечисления.ВидыЗанятости.Совместительство);
		Запрос.УстановитьПараметр("Организация", СтрокаОрганизации.Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник, 
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	СУММА(ТаблицаИтоговыхДанных.Норма) КАК Норма,
		               |	СУММА(ТаблицаИтоговыхДанных.Работа) КАК Работа
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	ВТТаблицаИтоговыхДанных КАК ТаблицаИтоговыхДанных
		               |ГДЕ
		               |	ТаблицаИтоговыхДанных.ВидЗанятости = &ВидЗанятости
		               |	И ТаблицаИтоговыхДанных.Организация = &Организация
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник, 
					   |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник,
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма КАК Норма,
		               |	ТаблицаИтоговыхДанных.Работа КАК Работа,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТаблицаИтоговыхДанных.Норма ЕСТЬ NULL
		               |					ИЛИ ТаблицаИтоговыхДанных.Норма = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ ТаблицаИтоговыхДанных.Работа / ТаблицаИтоговыхДанных.Норма
		               |		КОНЕЦ) КАК Средняя
		               |ИЗ
		               |	ВТДанные КАК ТаблицаИтоговыхДанных
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник, 
		               |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма,
		               |	ТаблицаИтоговыхДанных.Работа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Наименование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТДанные";   
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьЭПЗСовместители.Параметры, Выборка);   
			Если Не Выборка.Средняя = 0 Тогда
				ДокументРезультат.Вывести(ОбластьЭПЗСовместители);  
			КонецЕсли;	
			Средняя = Средняя + Выборка.Средняя; 
			Норма = Норма + Выборка.Норма;      
			Работа = Работа + Выборка.Работа; 
		КонецЦикла;	  
		ОбластьЭПЗСовместителиИтог.Параметры.Средняя = Средняя;   
		ОбластьЭПЗСовместителиИтог.Параметры.Норма = Норма;     
		ОбластьЭПЗСовместителиИтог.Параметры.Работа = Работа;
		ДокументРезультат.Вывести(ОбластьЭПЗСовместителиИтог);  
		
		Средняя = 0; Норма = 0 ; Работа = 0;
        ДокументРезультат.Вывести(ОбластьЭПЗОсновныеЗаголовок);
		Запрос.УстановитьПараметр("ВидЗанятости", Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		Запрос.УстановитьПараметр("Организация", СтрокаОрганизации.Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник, 
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	СУММА(ТаблицаИтоговыхДанных.Норма) КАК Норма,
		               |	СУММА(ТаблицаИтоговыхДанных.Работа) КАК Работа
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	ВТТаблицаИтоговыхДанных КАК ТаблицаИтоговыхДанных
		               |ГДЕ
		               |	ТаблицаИтоговыхДанных.ВидЗанятости = &ВидЗанятости
		               |	И ТаблицаИтоговыхДанных.Организация = &Организация
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник,   
					   |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник, 
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма КАК Норма,
		               |	ТаблицаИтоговыхДанных.Работа КАК Работа,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТаблицаИтоговыхДанных.Норма ЕСТЬ NULL
		               |					ИЛИ ТаблицаИтоговыхДанных.Норма = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ ТаблицаИтоговыхДанных.Работа / ТаблицаИтоговыхДанных.Норма
		               |		КОНЕЦ) КАК Средняя
		               |ИЗ
		               |	ВТДанные КАК ТаблицаИтоговыхДанных
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник,
		               |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма,
		               |	ТаблицаИтоговыхДанных.Работа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Наименование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТДанные";   
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьЭПЗОсновные.Параметры, Выборка); 
			Если Не Выборка.Средняя = 0 Тогда
				ДокументРезультат.Вывести(ОбластьЭПЗОсновные);
			КонецЕсли;	
			Средняя = Средняя + Выборка.Средняя; 
			Норма = Норма + Выборка.Норма;      
			Работа = Работа + Выборка.Работа; 
		КонецЦикла;	  
		ОбластьЭПЗОсновныеИтог.Параметры.Средняя = Средняя;   
		ОбластьЭПЗОсновныеИтог.Параметры.Норма = Норма;     
		ОбластьЭПЗОсновныеИтог.Параметры.Работа = Работа;
		ДокументРезультат.Вывести(ОбластьЭПЗОсновныеИтог);  
		
		Средняя = 0; Норма = 0 ; Работа = 0;
        ДокументРезультат.Вывести(ОбластьЭПЗВнутренниеЗаголовок);
		Запрос.УстановитьПараметр("ВидЗанятости", Перечисления.ВидыЗанятости.ВнутреннееСовместительство);
		Запрос.УстановитьПараметр("Организация", СтрокаОрганизации.Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник,  
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	СУММА(ТаблицаИтоговыхДанных.Норма) КАК Норма,
		               |	СУММА(ТаблицаИтоговыхДанных.Работа) КАК Работа
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	ВТТаблицаИтоговыхДанных КАК ТаблицаИтоговыхДанных
		               |ГДЕ
		               |	ТаблицаИтоговыхДанных.ВидЗанятости = &ВидЗанятости
		               |	И ТаблицаИтоговыхДанных.Организация = &Организация
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник,
					   |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаИтоговыхДанных.Сотрудник КАК Сотрудник, 
		               |	ТаблицаИтоговыхДанных.Наименование КАК Наименование, 
		               |	ТаблицаИтоговыхДанных.Организация КАК Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости КАК ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма КАК Норма,
		               |	ТаблицаИтоговыхДанных.Работа КАК Работа,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТаблицаИтоговыхДанных.Норма ЕСТЬ NULL
		               |					ИЛИ ТаблицаИтоговыхДанных.Норма = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ ТаблицаИтоговыхДанных.Работа / ТаблицаИтоговыхДанных.Норма
		               |		КОНЕЦ) КАК Средняя
		               |ИЗ
		               |	ВТДанные КАК ТаблицаИтоговыхДанных
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаИтоговыхДанных.Сотрудник,
					   |	ТаблицаИтоговыхДанных.Наименование,
		               |	ТаблицаИтоговыхДанных.Организация,
		               |	ТаблицаИтоговыхДанных.ВидЗанятости,
		               |	ТаблицаИтоговыхДанных.Норма,
		               |	ТаблицаИтоговыхДанных.Работа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Наименование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТДанные";   
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьЭПЗВнутренние.Параметры, Выборка);   
			Если Не Выборка.Средняя = 0 Тогда
				ДокументРезультат.Вывести(ОбластьЭПЗВнутренние); 
			КонецЕсли;	
			Средняя = Средняя + Выборка.Средняя; 
			Норма = Норма + Выборка.Норма;      
			Работа = Работа + Выборка.Работа; 
		КонецЦикла;	  
		ОбластьЭПЗВнутренниеИтог.Параметры.Средняя = Средняя;   
		ОбластьЭПЗВнутренниеИтог.Параметры.Норма = Норма;     
		ОбластьЭПЗВнутренниеИтог.Параметры.Работа = Работа;
		ДокументРезультат.Вывести(ОбластьЭПЗВнутренниеИтог);  

	КонецЦикла;
	
КонецПроцедуры   

Функция ПреобразоватьМассивВТаблицу(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Для Сч = 0 По Массив.Количество()-1 Цикл
		СтрокаТаблицы = Таблица.Добавить();  
		СтрокаТаблицы.Сотрудник = Массив[Сч].Сотрудник;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИнициализироватьОтчет();
	ЗначениеВДанныеФормы(ЭтотОбъект, Форма.Отчет);
	
КонецПроцедуры

// Функция возвращает структуру настроек отчета.
//
Функция ПолучитьНастройкиОтчета() Экспорт
	
	// Получим настройки по умолчанию.
	Настройки = ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию();
	
	Возврат Настройки;
	
КонецФункции


#КонецОбласти

#КонецЕсли