#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
//
// Параметры:
// 		КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	
	
КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеИзЭксплуатации) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.СписаниеИзЭксплуатации.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.СписаниеИзЭксплуатации);
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьВнутреннееПотребление";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуМатериалыВЭксплуатации(КомандыОтчетов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТМЦВЭксплуатации(ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Ложь, Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Подразделение", Реквизиты.Подразделение);
	
КонецПроцедуры

Процедура ТМЦВЭксплуатации(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТМЦВЭксплуатации";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// ТМЦВЭксплуатации
	|" +
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	ТабличнаяЧасть.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧасть.Характеристика КАК Характеристика,
	|	ТабличнаяЧасть.ПартияТМЦВЭксплуатации КАК Партия,
	|	-ТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка" + ";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
	Возврат
		СписаниеИзЭксплуатацииУКР()
		+ "";
		
КонецФункции

Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	Возврат ТекстЗапросаВТСтоимостьТМЦВЭксплуатацииУКР()
	+"";
		
КонецФункции

Функция ТекстЗапросаВТСтоимостьТМЦВЭксплуатацииУКР()
	
	Возврат
		  "ВЫБРАТЬ
		  |	ПланСчетов.Ссылка КАК Ссылка
		  |ПОМЕСТИТЬ втСчетаТЦМВЭксплуатации
		  |ИЗ
		  |	ПланСчетов.Хозрасчетный КАК ПланСчетов
		  |ГДЕ
		  |	ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
		  |	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации)
		  |	И ПланСчетов.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		  |	И НЕ ПланСчетов.Забалансовый
		  |	И ПланСчетов.Количественный
		  |	И НЕ ПланСчетов.ЗапретитьИспользоватьВПроводках
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Ссылка
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	СписаниеИзЭксплуатацииТовары.Ссылка КАК Ссылка,
		  |	СписаниеИзЭксплуатацииТовары.Ссылка.Организация КАК Организация,
		  |	СписаниеИзЭксплуатацииТовары.Ссылка.Подразделение КАК Подразделение,
		  |	СписаниеИзЭксплуатацииТовары.Номенклатура КАК Номенклатура,
		  |	СписаниеИзЭксплуатацииТовары.Характеристика,
		  |	ВЫРАЗИТЬ(СписаниеИзЭксплуатацииТовары.ФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
		  |	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
		  |	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК КатегорияЭксплуатации,
		  |	СУММА(СписаниеИзЭксплуатацииТовары.Количество) КАК Количество
		  |ПОМЕСТИТЬ втСписаниеТЦМ
		  |ИЗ
		  |	Документ.СписаниеИзЭксплуатации.Товары КАК СписаниеИзЭксплуатацииТовары
		  |ГДЕ
		  |	СписаниеИзЭксплуатацииТовары.Ссылка = &Ссылка
		  |	И СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В (ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив), ЗНАЧЕНИЕ(Перечисление.ВидыТМЦВЭксплуатации.БиблиотечныеФонды))
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	СписаниеИзЭксплуатацииТовары.Номенклатура,
		  |	СписаниеИзЭксплуатацииТовары.Характеристика,
		  |	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации,
		  |	СписаниеИзЭксплуатацииТовары.Ссылка.Организация,
		  |	СписаниеИзЭксплуатацииТовары.Ссылка.Подразделение,
		  |	СписаниеИзЭксплуатацииТовары.Ссылка,
		  |	ВЫРАЗИТЬ(СписаниеИзЭксплуатацииТовары.ФизическоеЛицо КАК Справочник.ФизическиеЛица),
		  |	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Организация,
		  |	Подразделение,
		  |	Номенклатура,
		  |	ПартияТМЦВЭксплуатации
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	втСписаниеТЦМ.Ссылка,
		  |	втСписаниеТЦМ.Номенклатура КАК Номенклатура,
		  |	втСписаниеТЦМ.Характеристика КАК Характеристика,
		  |	втСписаниеТЦМ.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
		  |	втСписаниеТЦМ.ФизическоеЛицо,
		  |	втСписаниеТЦМ.Количество,
		  |	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
		  |	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		  |	втСписаниеТЦМ.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК КатегорияЭксплуатации,
		  |	ХозрасчетныйОстатки.НалоговоеНазначение,
		  |	ВЫБОР
		  |		КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0) = втСписаниеТЦМ.Количество
		  |			ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0)
		  |		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0) * втСписаниеТЦМ.Количество / ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0)
		  |	КОНЕЦ КАК Стоимость,
		  |	ВЫБОР
		  |		КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0) = втСписаниеТЦМ.Количество
		  |			ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУОстатокДт, 0)
		  |		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОстатки.СуммаНУОстатокДт, 0) * втСписаниеТЦМ.Количество / ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0)
		  |	КОНЕЦ КАК СтоимостьНУ
		  |ПОМЕСТИТЬ втСтоимостиТМЦВЭксплуатации
		  |ИЗ
		  |	РегистрБухгалтерии.Хозрасчетный.Остатки(
		  |			&Дата,
		  |			Счет В
		  |				(ВЫБРАТЬ
		  |					Т.Ссылка
		  |				ИЗ
		  |					втСчетаТЦМВЭксплуатации КАК Т),
		  |			,
		  |			(Организация, Подразделение, Субконто1, Субконто2) В
		  |				(ВЫБРАТЬ
		  |					Т.Организация,
		  |					Т.Подразделение,
		  |					Т.Номенклатура,
		  |					Т.ПартияТМЦВЭксплуатации
		  |				ИЗ
		  |					втСписаниеТЦМ КАК Т)) КАК ХозрасчетныйОстатки
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСписаниеТЦМ КАК втСписаниеТЦМ
		  |		ПО ХозрасчетныйОстатки.Субконто1 = втСписаниеТЦМ.Номенклатура
		  |			И ХозрасчетныйОстатки.Субконто2 = втСписаниеТЦМ.ПартияТМЦВЭксплуатации
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Номенклатура,
		  |	Характеристика,
		  |	ПартияТМЦВЭксплуатации"+ ";";
		
КонецФункции

Функция СписаниеИзЭксплуатацииУКР()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Списание из эксплуатации товаров (Дт 1322 :: Кт 111, 1122)
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	втСтоимостиТМЦВЭксплуатации.Стоимость КАК Сумма, 
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииАмортизация) КАК ВидСчетаДт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеДт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоДт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	втСтоимостиТМЦВЭксплуатации.Количество КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатации) КАК ВидСчетаКт,
	|	втСтоимостиТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Операция.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	втСтоимостиТМЦВЭксплуатации.НалоговоеНазначение КАК НалоговоеНазначениеКт, 
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	втСтоимостиТМЦВЭксплуатации.Номенклатура КАК СубконтоКт1,
	|	втСтоимостиТМЦВЭксплуатации.ПартияТМЦВЭксплуатации КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	втСтоимостиТМЦВЭксплуатации.Количество КАК КоличествоКт,
	|	втСтоимостиТМЦВЭксплуатации.Стоимостьну КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Списание ТМЦ из эксплуатации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеИзЭксплуатации КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		втСтоимостиТМЦВЭксплуатации КАК втСтоимостиТМЦВЭксплуатации
	|	ПО
	|		Операция.Ссылка = втСтоимостиТМЦВЭксплуатации.Ссылка
	|";
	
КонецФункции

#КонецОбласти

#Область Печать

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ3(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеОС_ОЗ3";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_ОЗ3");
	
	ПервыйДокумент = Истина;
	
	ВидТМЦВЭксплуатации = Новый Массив;
	ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив);
	ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.БиблиотечныеФонды);
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатации.Номер 	        КАК НомерАкта,
		|	СписаниеИзЭксплуатации.Дата	            КАК ДатаАкта,
		|	СписаниеИзЭксплуатации.Организация      КАК Организация,
		|	СписаниеИзЭксплуатации.Подразделение	КАК СдалоПодразделение,
		|	""Списання"" 							КАК ВидОперации
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации КАК СписаниеИзЭксплуатации
		|
		|ГДЕ
		|	СписаниеИзЭксплуатации.Ссылка = &Ссылка";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВидТМЦ", ВидТМЦВЭксплуатации);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатацииТовары.Номенклатура,
		|	СписаниеИзЭксплуатацииТовары.Характеристика,
		|	СписаниеИзЭксплуатацииТовары.ФизическоеЛицо КАК Сотрудник,
		|	СУММА(СписаниеИзЭксплуатацииТовары.Количество) КАК Количество,
		|	МИНИМУМ(СписаниеИзЭксплуатацииТовары.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации.Товары КАК СписаниеИзЭксплуатацииТовары
		|ГДЕ
		|	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В(&ВидТМЦ)
		|	И СписаниеИзЭксплуатацииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеИзЭксплуатацииТовары.Номенклатура,
		|	СписаниеИзЭксплуатацииТовары.Характеристика,
		|	СписаниеИзЭксплуатацииТовары.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			Возврат ТабДокумент;
		КонецЕсли;
	
		Выборка = РезультатЗапроса.Выбрать();
		
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(Ссылка);
		
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);
		
		Пока Выборка.Следующий() Цикл

			ОбластьМакета = Макет.ПолучитьОбласть("ОЗ3");
			Параметры     = ОбластьМакета.Параметры;
			
			Параметры.Заполнить(Шапка);
			Параметры.Заполнить(Выборка);
			Параметры.Заполнить(ВыборкаПоКомиссии);

			Параметры.НаименованиеОС = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
													Выборка.Номенклатура,
													Выборка.Характеристика);

			
			СведенияОбОрганизации	= ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);	
			Параметры.Организация	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,);
			Параметры.ЕДРПОУ		= СведенияОбОрганизации.КодПоЕДРПОУ;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;
	
КонецФункции // ПечатьОЗ1()

Функция ПечатьСписанияОС_2016(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСписанияОС";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктСписанияОСБюдж_2016");
	
	ПервыйДокумент = Истина;
		
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатации.Номер КАК НомерАкта,
		|	СписаниеИзЭксплуатации.Дата КАК ДатаАкта,
		|	СписаниеИзЭксплуатации.Организация КАК Организация,
		|	СписаниеИзЭксплуатации.Организация.КодПоЕДРПОУ КАК ЕДРПОУ,
		|	СписаниеИзЭксплуатации.Подразделение КАК СдалоПодразделение,
		|	СписаниеИзЭксплуатации.Основание
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации КАК СписаниеИзЭксплуатации
		|ГДЕ
		|	СписаниеИзЭксплуатации.Ссылка = &Ссылка";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации);
		Запрос.УстановитьПараметр("Субконто", МассивСубконто);
		ВидТМЦВЭксплуатации = Новый Массив;
		ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив);
		ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.БиблиотечныеФонды);
		Запрос.УстановитьПараметр("ВидТМЦ", ВидТМЦВЭксплуатации);
		Запрос.УстановитьПараметр("МоментДокумента", Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Организация"    , Ссылка.Организация);
		Запрос.УстановитьПараметр("Подразделение"  , Ссылка.Подразделение);
		Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеНеоборотныеМатериальныеАктивыКоличественно);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатацииТовары.Номенклатура,
		|	СписаниеИзЭксплуатацииТовары.Номенклатура.Код КАК ИнвентарныйНомер,
		|	СписаниеИзЭксплуатацииТовары.Характеристика,
		|	СписаниеИзЭксплуатацииТовары.ФизическоеЛицо КАК МОЛ,
		|	СписаниеИзЭксплуатацииТовары.Количество КАК Количество,
		|	0 КАК ЛиквидационнаяСтоимость,
		|	Хозрасчетный.СубконтоКт2.Дата КАК ДатаВвода,
		|	ЕСТЬNULL(ВЫБОР
		|		КОГДА Хозрасчетный.КоличествоОборотКт = 0
		|			ТОГДА Хозрасчетный.СуммаОборот
		|		ИНАЧЕ Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотКт
		|	КОНЕЦ, 0) КАК ПервоначальнаяСтоимость
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации.Товары КАК СписаниеИзЭксплуатацииТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&МоментДокумента, &МоментДокумента, , , , СчетКт = &СчетМЦ, &Субконто, ) КАК Хозрасчетный
		|		ПО СписаниеИзЭксплуатацииТовары.Номенклатура = Хозрасчетный.СубконтоКт1
		|			И СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации = Хозрасчетный.СубконтоКт2
		|ГДЕ
		|	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В(&ВидТМЦ)
		|	И СписаниеИзЭксплуатацииТовары.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	МОЛ";
	
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			Возврат ТабДокумент;
		КонецЕсли; 
		
		СписокМОЛ = Результат.Выгрузить();
		СписокМОЛ.Свернуть("МОЛ");
			
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(Ссылка);
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);
		
		ОбластьМакетаШапка	  = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока	  = Макет.ПолучитьОбласть("Строка");
		ОбластьДанныеПодвал   = Макет.ПолучитьОбласть("Подвал");   
		ОбластьДанныеСтрокаЧЛ = Макет.ПолучитьОбласть("СтрокаЧЛ");   
		ОбластьДанныеКомиссия = Макет.ПолучитьОбласть("ДанныеКомиссия");   
		
		//Данные БУ
		ОбластьДанныеБУШапка  = Макет.ПолучитьОбласть("ДанныеБУШапка");
		ОбластьДанныеБУСтрока = Макет.ПолучитьОбласть("ДанныеБУСтрока");
		ОбластьДанныеБУПодвал = Макет.ПолучитьОбласть("ДанныеБУПодвал");  
		
		ВыборкаМОЛ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		НеПервая = Ложь;
		
		Пока ВыборкаМОЛ.Следующий() Цикл      
			
			Если НеПервая Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
			Параметры = ОбластьМакетаШапка.Параметры;
			Параметры.Заполнить(Шапка);
			
			Параметры.Должность_Руководитель = ОтветственныеЛица.РуководительДолжностьПредставление + ?(ЗначениеЗаполнено(ОтветственныеЛица.РуководительДолжностьПредставление),",",""); 
			Параметры.ФИО_Руководитель		 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(ОтветственныеЛица.РуководительФИО);     
			Параметры.ДатаАктаПрописью		 = Формат(Шапка.ДатаАкта, "ДЛФ=DD");
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			ВыборкаПоОС = ВыборкаМОЛ.Выбрать();   
			
			Пока ВыборкаПоОС.Следующий() Цикл
				
				Параметры     = ОбластьМакетаСтрока.Параметры;
				Параметры.Заполнить(ВыборкаПоОС);
				Параметры.ЛиквидационнаяСтоимость = Формат(ВыборкаПоОС.ЛиквидационнаяСтоимость, "ЧЦ=15; ЧДЦ=2; ЧН=");   
				Параметры.Амортизация			  = ВыборкаПоОС.ПервоначальнаяСтоимость;   
				Параметры.ДатаВвода				  = Формат(ВыборкаПоОС.ДатаВвода, "ДЛФ=Д");   
				Параметры.НаименованиеОС 		  = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаПоОС.Номенклатура, ВыборкаПоОС.Характеристика);
				ТабДокумент.Вывести(ОбластьМакетаСтрока);  
				
			КонецЦикла;   
			
			Параметры     = ОбластьДанныеПодвал.Параметры;  
			Параметры.Заполнить(Шапка);
			
			ОсновныеСотрудникиФизическихЛицМОЛ = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыборкаМОЛ.МОЛ, Истина, Ссылка.Организация, Ссылка.Дата);
			Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицМОЛ) Тогда		
				Для каждого Строка Из ОсновныеСотрудникиФизическихЛицМОЛ Цикл
					ДанныеФизЛицаМОЛ = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);
				КонецЦикла;
				Для каждого СтрокаДанныеМОЛ Из ДанныеФизЛицаМОЛ Цикл
					Параметры.МОЛ_Должность = ?(ЗначениеЗаполнено(СтрокаДанныеМОЛ.Должность), СтрокаДанныеМОЛ.Должность.НаименованиеКраткое + ",", "");  
					Параметры.МОЛ_ФИО = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(СтрокаДанныеМОЛ.ФизическоеЛицо.ФИО);  
				КонецЦикла;			
			КонецЕсли; 
			ТабДокумент.Вывести(ОбластьДанныеПодвал); 
			ТабДокумент.Вывести(ОбластьДанныеСтрокаЧЛ);
			Параметры = ОбластьДанныеКомиссия.Параметры;  
			Параметры.Заполнить(ВыборкаПоКомиссии);	
			ТабДокумент.Вывести(ОбластьДанныеКомиссия);
			
			ТабДокумент.Вывести(ОбластьДанныеБУШапка);       
			Параметры = ОбластьДанныеБУСтрока.Параметры;
			Если СписокМОЛ.Количество() = 1 Тогда 
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Хозрасчетный.СчетДт КАК СчетДт,
				|	Хозрасчетный.СчетКт КАК СчетКт,
				|	Хозрасчетный.Сумма КАК Сумма
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
				|ГДЕ
				|	Хозрасчетный.Регистратор = &Ссылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	Хозрасчетный.НомерСтроки";      
				Результат = Запрос.Выполнить();
				ВыборкаБУ = Результат.Выбрать();  
				
				Пока ВыборкаБУ.Следующий() Цикл 
					
					Параметры.Заполнить(ВыборкаБУ); 
					Параметры.СчетКт = ?(ВыборкаБУ.СчетКт = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), "-", ВыборкаБУ.СчетКт);
					Параметры.СчетДт = ?(ВыборкаБУ.СчетДт = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), "-", ВыборкаБУ.СчетДт);
					ТабДокумент.Вывести(ОбластьДанныеБУСтрока);    
					
				КонецЦикла;
				
			Иначе       
				
				ТабДокумент.Вывести(ОбластьДанныеБУСтрока);      
				
			КонецЕсли; 
			
			Параметры = ОбластьДанныеБУПодвал.Параметры;      
			Параметры.ОтветственныйДолжность = ДолжностиДляПечатиКлиентСервер.ДолжностьФизическогоЛица(Ссылка.Ответственный.ФизическоеЛицо, Ссылка.Организация, Ссылка.Дата);;
			Параметры.ОтветственныйДолжность = ?(ЗначениеЗаполнено(Параметры.ОтветственныйДолжность),Параметры.ОтветственныйДолжность + ",","");
			Параметры.ОтветственныйФИО   	 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(Ссылка.Ответственный.ФизическоеЛицо.ФИО);  
			Параметры.ГлавныйБухгалтер	 	 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(ОтветственныеЛица.ГлавныйБухгалтерФИО);  
			ТабДокумент.Вывести(ОбластьДанныеБУПодвал);  
			
			НеПервая = Истина;
			
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;
	
КонецФункции //ПечатьСписанияОС_2016() 

Функция ПечатьСписанияГруппыОС_2016(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСписанияГруппыОС";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктСписанияОСГруппаБюдж_2016");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатации.Номер КАК НомерАкта,
		|	СписаниеИзЭксплуатации.Дата КАК ДатаАкта,
		|	СписаниеИзЭксплуатации.Организация КАК Организация,
		|	СписаниеИзЭксплуатации.Подразделение КАК СдалоПодразделение,
		|	СписаниеИзЭксплуатации.Организация.КодПоЕДРПОУ КАК ЕДРПОУ,
		|	СписаниеИзЭксплуатации.Основание
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации КАК СписаниеИзЭксплуатации
		|ГДЕ
		|	СписаниеИзЭксплуатации.Ссылка = &Ссылка";

		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМатериаловВЭксплуатации);
		Запрос.УстановитьПараметр("Субконто", МассивСубконто);
		ВидТМЦВЭксплуатации = Новый Массив;
		ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.МалоценныйНеоборотныйАктив);
		ВидТМЦВЭксплуатации.Добавить(Перечисления.ВидыТМЦВЭксплуатации.БиблиотечныеФонды);
		Запрос.УстановитьПараметр("ВидТМЦ", ВидТМЦВЭксплуатации);
		Запрос.УстановитьПараметр("МоментДокумента", Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Организация"    , Ссылка.Организация);
		Запрос.УстановитьПараметр("Подразделение"  , Ссылка.Подразделение);
		Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеНеоборотныеМатериальныеАктивыКоличественно);
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеИзЭксплуатацииТовары.Номенклатура,
		|	СписаниеИзЭксплуатацииТовары.Номенклатура.Код КАК ИнвентарныйНомер,
		|	СписаниеИзЭксплуатацииТовары.Характеристика,
		|	СписаниеИзЭксплуатацииТовары.ФизическоеЛицо КАК МОЛ,
		|	СписаниеИзЭксплуатацииТовары.Количество КАК Количество,
		|	Хозрасчетный.СубконтоКт2.Дата КАК ДатаВвода,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА Хозрасчетный.КоличествоОборотКт = 0
		|				ТОГДА Хозрасчетный.СуммаОборот
		|			ИНАЧЕ Хозрасчетный.СуммаОборот / Хозрасчетный.КоличествоОборотКт
		|		КОНЕЦ, 0) КАК ПервоначальнаяСтоимость
		|ИЗ
		|	Документ.СписаниеИзЭксплуатации.Товары КАК СписаниеИзЭксплуатацииТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&МоментДокумента, &МоментДокумента, , , , СчетКт = &СчетМЦ, &Субконто, ) КАК Хозрасчетный
		|		ПО СписаниеИзЭксплуатацииТовары.Номенклатура = Хозрасчетный.СубконтоКт1
		|			И СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации = Хозрасчетный.СубконтоКт2
		|ГДЕ
		|	СписаниеИзЭксплуатацииТовары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ В(&ВидТМЦ)
		|	И СписаниеИзЭксплуатацииТовары.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	МОЛ";
	
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			Возврат ТабДокумент;
		КонецЕсли;
	
		СписокМОЛ = Результат.Выгрузить();
		СписокМОЛ.Свернуть("МОЛ");
		
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(Ссылка);
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);
		
		ОбластьМакетаШапка	  = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока	  = Макет.ПолучитьОбласть("Строка");
		ОбластьДанныеПодвал   = Макет.ПолучитьОбласть("Подвал");
		ОбластьДанныеКомиссия = Макет.ПолучитьОбласть("Комиссия");
		ОбластьДанныеСписание = Макет.ПолучитьОбласть("РезультатСписания");
		//Данные БУ
		ОбластьДанныеБУШапка  = Макет.ПолучитьОбласть("ДанныеБУШапка");
		ОбластьДанныеБУСтрока = Макет.ПолучитьОбласть("ДанныеБУСтрока");
		ОбластьДанныеБУПодвал = Макет.ПолучитьОбласть("ДанныеБУПодвал");
		
		ВыборкаМОЛ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		НеПервая = Ложь;
		
		Пока ВыборкаМОЛ.Следующий() Цикл      
			
			Если НеПервая Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			Параметры     = ОбластьМакетаШапка.Параметры;
			Параметры.Заполнить(Шапка);
			Параметры.Должность_Руководитель = ОтветственныеЛица.РуководительДолжностьПредставление;
			Параметры.Должность_Руководитель = ОтветственныеЛица.РуководительДолжностьПредставление + ?(ЗначениеЗаполнено(ОтветственныеЛица.РуководительДолжностьПредставление),",",""); 
			Параметры.ФИО_Руководитель		 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(ОтветственныеЛица.РуководительФИО);     
			Параметры.ДатаАктаПрописью		 = Формат(Шапка.ДатаАкта, "ДЛФ=DD");
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			КоличествоВсего = 0;
			СуммаВсего = 0;
			ВыборкаОС = ВыборкаМОЛ.Выбрать();   
			Пока ВыборкаОС.Следующий() Цикл
				
				Параметры     = ОбластьМакетаСтрока.Параметры;
				Параметры.Заполнить(ВыборкаОС);
				Параметры.НаименованиеОС = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ВыборкаОС.Номенклатура, ВыборкаОС.Характеристика);
				Параметры.ДатаВвода   = Формат(ВыборкаОС.ДатаВвода, "ДЛФ=Д");  
				Сумма = ?(Ссылка.Проведен, ВыборкаОС.Количество * ВыборкаОС.ПервоначальнаяСтоимость, 0);
				Параметры.Сумма 	  = Сумма;   
				СуммаВсего			  = СуммаВсего + Сумма;   
				КоличествоВсего 	  = КоличествоВсего + ?(Ссылка.Проведен, ВыборкаОС.Количество, 0);   
				
				ТабДокумент.Вывести(ОбластьМакетаСтрока); 
				
			КонецЦикла;
			
			Параметры     = ОбластьДанныеПодвал.Параметры;  
			Параметры.Заполнить(Шапка);
			Параметры.СуммаВсего 	  = СуммаВсего;
			Параметры.КоличествоВсего = КоличествоВсего;
			ОсновныеСотрудникиФизическихЛицМОЛ = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыборкаМОЛ.МОЛ, Истина, Ссылка.Организация, Ссылка.Дата);
			Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицМОЛ) Тогда		
				Для каждого Строка Из ОсновныеСотрудникиФизическихЛицМОЛ Цикл
					ДанныеФизЛицаМОЛ = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);
				КонецЦикла;
				Для каждого СтрокаДанныеМОЛ Из ДанныеФизЛицаМОЛ Цикл
					Параметры.МОЛ_Должность = ?(ЗначениеЗаполнено(СтрокаДанныеМОЛ.Должность), СтрокаДанныеМОЛ.Должность.НаименованиеКраткое + ",", "");  
					Параметры.МОЛ_ФИО 		= ФизическиеЛицаКлиентСервер.ИнициалыФамилия(СтрокаДанныеМОЛ.ФизическоеЛицо.ФИО);  
				КонецЦикла;			
			КонецЕсли;    
			ТабДокумент.Вывести(ОбластьДанныеПодвал);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Параметры     = ОбластьДанныеКомиссия.Параметры;
			Параметры.Заполнить(ВыборкаПоКомиссии);	
			ТабДокумент.Вывести(ОбластьДанныеКомиссия);
			
			ТабДокумент.Вывести(ОбластьДанныеСписание);
			ТабДокумент.Вывести(ОбластьДанныеБУШапка);
			Параметры     = ОбластьДанныеБУСтрока.Параметры;
			Если СписокМОЛ.Количество() = 1 Тогда 
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Хозрасчетный.СчетДт КАК СчетДт,
				|	Хозрасчетный.СчетКт КАК СчетКт,
				|	Хозрасчетный.Сумма КАК Сумма
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
				|ГДЕ
				|	Хозрасчетный.Регистратор = &Ссылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	Хозрасчетный.НомерСтроки";      
				Результат = Запрос.Выполнить();
				ВыборкаБУ = Результат.Выбрать();  
				
				Пока ВыборкаБУ.Следующий() Цикл 
					
					Параметры.Заполнить(ВыборкаБУ); 
					Параметры.СчетКт = ?(ВыборкаБУ.СчетКт = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), "-", ВыборкаБУ.СчетКт);
					Параметры.СчетДт = ?(ВыборкаБУ.СчетДт = ПланыСчетов.Хозрасчетный.ПустаяСсылка(), "-", ВыборкаБУ.СчетДт);
					ТабДокумент.Вывести(ОбластьДанныеБУСтрока);    
					
				КонецЦикла;
				
			Иначе       
				
				ТабДокумент.Вывести(ОбластьДанныеБУСтрока);      
				
			КонецЕсли; 

			Параметры = ОбластьДанныеБУПодвал.Параметры;
			Параметры.ОтветственныйДолжность = ДолжностиДляПечатиКлиентСервер.ДолжностьФизическогоЛица(Ссылка.Ответственный.ФизическоеЛицо, Ссылка.Организация, Ссылка.Дата);
			Параметры.ОтветственныйДолжность = ?(ЗначениеЗаполнено(Параметры.ОтветственныйДолжность),Параметры.ОтветственныйДолжность + ",","");
			Параметры.ОтветственныйФИО   	 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(Ссылка.Ответственный.ФизическоеЛицо.ФИО);  
			Параметры.ГлавныйБухгалтер	 	 = ФизическиеЛицаКлиентСервер.ИнициалыФамилия(ОтветственныеЛица.ГлавныйБухгалтерФИО);  
			ТабДокумент.Вывести(ОбластьДанныеБУПодвал);  
			НеПервая = Истина;
			
		КонецЦикла;    
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	
		
	Возврат ТабДокумент;
	
КонецФункции    //ПечатьСписанияГруппыОС_2016()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Подразделение) КАК Подразделение,
	|	Документ.Организация КАК Организация,
	|	Документ.Организация.Префикс КАК Префикс,
	|	Документ.ЧерезКого КАК МОЛ,
	|	""Списання"" КАК КодОперации,
	|	Документ.Товары.(
	|		НомерСтроки КАК НомерПП,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Код КАК НоменклатурныйНомерКод,
	|		Номенклатура.Артикул КАК НоменклатурныйНомерАртикул,
	|		Характеристика.НаименованиеПолное КАК Характеристика,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|		Количество КАК Количество,
	|		ПартияТМЦВЭксплуатации.Дата КАК ДатаПоступленияВЭксплуатацию,
	|		ПартияТМЦВЭксплуатации.СрокЭксплуатации КАК СрокСлужбы,
	|		ФизическоеЛицо  КАК Сотрудник
	|	) КАК ТаблицаТовары
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.Товары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ = &ВидТМЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	НомерПП";
	
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.УстановитьПараметр("ВидТМЦ",Перечисления.ВидыТМЦВЭксплуатации.МалоценныйБыстроизнашивающийсяПредмет);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИзЭксплуатации_МШ7";
	
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_UK_МШ7");
	
	
	Если ЗапросПоДокументам.Выполнить().Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодписи   = Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрока	 = Макет.ПолучитьОбласть("Строка");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ВыборкаСтроки = ВыборкаДокументы.ТаблицаТовары.Выбрать();
		СписокФизическихЛиц = Новый Массив;
		Пока ВыборкаСтроки.Следующий() Цикл
			СписокФизическихЛиц.Добавить(ВыборкаСтроки.Сотрудник);
		КонецЦикла;
	КонецЦикла;
		
	ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Истина, ВыборкаДокументы.Организация, ВыборкаДокументы.Дата);
	СписокСотрудников = ОсновныеСотрудникиФизическихЛиц.ВыгрузитьКолонку("Сотрудник");
	Если ЗначениеЗаполнено(СписокСотрудников) Тогда
		ДанныеФизЛица = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "ФизическоеЛицо, ТабельныйНомер", ВыборкаДокументы.Ссылка.Дата);
	КонецЕсли;
	
	ВыборкаДокументы.Сбросить();
	ВыборкаСтроки.Сбросить();
	
	Пока ВыборкаДокументы.Следующий() Цикл
	
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.Дата);	
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,КодЯзыкаПечать);
		ОбластьЗаголовок.Параметры.КодПоЕДРПОУ  = СведенияОбОрганизации.КодПоЕДРПОУ;	
		ОбластьЗаголовок.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаДокументы.Номер, Ложь, Истина);
		ОбластьЗаголовок.Параметры.ДатаДокумента =  ВыборкаДокументы.Дата;
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьЗаголовок, ВыборкаДокументы.Ссылка);
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		// Вывод строк документа.
		ВыборкаСтроки = ВыборкаДокументы.ТаблицаТовары.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ОбластьСтрока.Параметры.ТабельныйНомер	= "";
			Если ДанныеФизЛица <> Неопределено Тогда
				СтрокаТЗ = ДанныеФизЛица.Найти(ВыборкаСтроки.Сотрудник, "ФизическоеЛицо");
			КонецЕсли;
			
			Если СтрокаТЗ <> Неопределено Тогда
				ОбластьСтрока.Параметры.ТабельныйНомер	= СтрокаТЗ.ТабельныйНомер;
			КонецЕсли;
			
			Если ТоварКод = "Артикул" Тогда
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерАртикул;
			Иначе
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерКод;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.МатериалНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаСтроки.Номенклатура,
				ВыборкаСтроки.Характеристика);
				
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		// Вывод подвала.
		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьПодписи);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);

	КонецЦикла;
		
	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ8(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Подразделение) КАК Подразделение,
	|	Документ.Организация КАК Организация,
	|	Документ.Организация.Префикс КАК Префикс,
	|	Документ.ЧерезКого КАК МОЛ,
	|	""Списання"" КАК КодОперации,
	|	Документ.Товары.(
	|		НомерСтроки КАК НомерПП,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Код КАК НоменклатурныйНомерКод,
	|		Номенклатура.Артикул КАК НоменклатурныйНомерАртикул,
	|		Характеристика.НаименованиеПолное КАК Характеристика,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|		Количество КАК Количество,
	|		ПартияТМЦВЭксплуатации.Дата КАК ДатаПоступления,
	|		ПартияТМЦВЭксплуатации.СрокЭксплуатации КАК СрокСлужбы,
	|		ФизическоеЛицо  КАК Сотрудник
	|	) КАК ТаблицаТовары
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.Товары.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации.ВидТМЦ = &ВидТМЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	НомерПП";
	
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.УстановитьПараметр("ВидТМЦ",Перечисления.ВидыТМЦВЭксплуатации.МалоценныйБыстроизнашивающийсяПредмет);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИзЭксплуатации_МШ8";
	
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеИзЭксплуатации.ПФ_MXL_UK_МШ8");
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ЗапросПоДокументам.Выполнить().Пустой() Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Возврат ТабДокумент;
			
		КонецЕсли;

	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	 	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодписи   	= Макет.ПолучитьОбласть("Подвал");
	ОбластьМеталлолом   = Макет.ПолучитьОбласть("Металлолом");
	
	ПервыйДокумент = Истина;
	
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	Пока ВыборкаДокументы.Следующий() Цикл
	
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументы);
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.Дата);	
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,КодЯзыкаПечать);
		ОбластьЗаголовок.Параметры.КодПоЕДРПОУ  = СведенияОбОрганизации.КодПоЕДРПОУ;	
		ОбластьЗаголовок.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаДокументы.Номер, Ложь, Истина);
		ОбластьЗаголовок.Параметры.ДатаДокумента =  ВыборкаДокументы.Дата;
		ОбластьЗаголовок.Параметры.Валюта = ВалютаРегламентированногоУчета;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьЗаголовок, ВыборкаДокументы.Ссылка);
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		// Вывод строк документа.
		ВыборкаСтроки = ВыборкаДокументы.ТаблицаТовары.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			
			Если ТоварКод = "Артикул" Тогда
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерАртикул;
			Иначе
				ОбластьСтрока.Параметры.НоменклатурныйНомер = ВыборкаСтроки.НоменклатурныйНомерКод;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.МатериалНаименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаСтроки.Номенклатура,
				ВыборкаСтроки.Характеристика);
				
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		// Вывод подвала.
		ОбластьПодписи.Параметры.Заполнить(ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьПодписи);
		
		ВыборкаПоКомиссии = ОбщегоНазначенияБПВызовСервера.ПолучитьСведенияОКомиссии(ВыборкаДокументы.Ссылка);
		
		ОбластьМеталлолом.Параметры.Заполнить(ВыборкаПоКомиссии);
		
		ТабДокумент.Вывести(ОбластьМеталлолом);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);

	КонецЦикла;
		
	Возврат ТабДокумент;

КонецФункции // ПечатьМШ8()

// Функция получает данные для формирования печатной формы М-11
//
Функция ПолучитьДанныеДляПечатнойФормыМ11(ПараметрыПечати, МассивДокументов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(
		МассивДокументов, 
		МенеджерВременныхТаблиц,
		,
		Новый Структура("Руководитель, ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	   |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)КАК Упаковка,
	|	Товары.Количество КАК Количество,
	|	Товары.ПартияТМЦВЭксплуатации КАК ПартияТМЦВЭксплуатации,
	|	Товары.ФизическоеЛицо,
	|	НЕОПРЕДЕЛЕНО КАК ФизическоеЛицоПолучатель
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 		[1] - Выборка по шапкам документов
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК ДатаДокумента,
	|	Документы.Дата КАК ДатаСоставления,
	|	Документы.Организация КАК Организация,
	|	Документы.Организация.Префикс КАК Префикс,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	Документы.Подразделение КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК КладовщикОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьКладовщикаОтправителя,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК РуководительОтправителя,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителяОтправителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтерОтправителя,
	|	""Списання"" КАК КодВидаОперации,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйВидЦены,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйВидЦеныВалютаЦены
	|ИЗ
	|	Документ.СписаниеИзЭксплуатации КАК Документы
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	Товары.Номенклатура.Код КАК НоменклатурныйНомерКод,
	|	Товары.Номенклатура.Артикул КАК НоменклатурныйНомерАртикул,
	|	Товары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмеренияНаименование,
	|	&ТекстЗапросаКодЕдиницыИзмерения КАК ЕдиницаИзмеренияКод,
	|	Товары.Количество КАК Количество,
	|	0 КАК Сумма,
	|	0 КАК Цена,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка 
	|";
	
		
			
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"Товары.Упаковка",
			"Товары.Номенклатура"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКодЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Код",
			"Товары.Упаковка",
			"Товары.Номенклатура"));
		
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	// Пакет запросов:
	// 		[0] - Временная таблица по табличной части документа
   	// 		[1] - Выборка по шапкам документов
	// 		[2] - Выборка по табличным частям документов
	
	Возврат Новый Структура(
		"РезультатПоШапке, РезультатПоТабличнойЧасти",
		РезультатПакетаЗапросов[1],
		РезультатПакетаЗапросов[2]);
	
КонецФункции


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ведомость МШ-7 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ7";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-7';uk='Відомість МШ-7'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Ведомость МШ-8
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МШ8";
	КомандаПечати.Представление = НСтр("ru='Ведомость МШ-8';uk='Відомість МШ-8'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	// Требование-накладная (М-11)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьМ11";
	КомандаПечати.Идентификатор = "М11";
	КомандаПечати.Представление = НСтр("ru='Требование-накладная (М-11)';uk='Вимога-накладна (М-11)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Форма ОЗ-1
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОЗ3";
	КомандаПечати.Представление = НСтр("ru='Форма ОЗ-3';uk='Форма ОЗ-3'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСписанияОСБюдж";
	КомандаПечати.Представление = НСтр("ru='Акт списания основных средств';uk='Акт списання основних засобів'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСписанияОСГруппаБюдж";
	КомандаПечати.Представление = НСтр("ru='Акт списания группы основных средств';uk='Акт списання групи основних засобів'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ7") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ7", НСтр("ru='Ведомость МШ-7';uk='Відомість МШ-7'"),
			ПечатьМШ7(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МШ8") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МШ8", НСтр("ru='Ведомость МШ-8';uk='Відомість МШ-8'"),
			ПечатьМШ8(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОЗ3") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОЗ3", НСтр("ru='Форма ОЗ-3';uk='Форма ОЗ-3'"),
			ПечатьОЗ3(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
	КонецЕсли;    
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияОСБюдж") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСписанияОСБюдж", НСтр("ru='Акт списания основных средств';uk='Акт списання основних засобів'"),
			ПечатьСписанияОС_2016(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
		КонецЕсли; 
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияОСГруппаБюдж") Тогда
		ИмяМакета = "";
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСписанияОСГруппаБюдж", НСтр("ru='Акт списания группы основных средств';uk='Акт списання групи основних засобів'"),
			ПечатьСписанияГруппыОС_2016(МассивОбъектов, ОбъектыПечати, ПараметрыВывода, ИмяМакета), , ИмяМакета);
	КонецЕсли;    
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли