
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.СредствоОплаты = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нужно указать по крайней мере тип средства оплаты.';uk='Потрібно вказати принаймні тип засобу оплати.'"),,
			"СредствоОплаты",, Отказ); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СредствоОплатыПриИзменении(Элемент)
	ЗаполнитьОписаниеСредстваОплаты(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОписаниеСредстваОплаты(Форма)
	
	Если Форма.Запись.СредствоОплаты = Неопределено Тогда
		Форма.Элементы.СредствоОплаты.ПодсказкаВвода = НСтр("ru='<Не выбран тип>';uk='<Не вибраний тип>'");
	ИначеЕсли Форма.Запись.СредствоОплаты = ПредопределенноеЗначение("Справочник.ЭквайринговыеТерминалы.ПустаяСсылка") Тогда
		Форма.Элементы.СредствоОплаты.ПодсказкаВвода = НСтр("ru='<Все эквайринговые терминалы>';uk='<Всі еквайрингові термінали>'");		
	ИначеЕсли Форма.Запись.СредствоОплаты = ПредопределенноеЗначение("Справочник.ВидыПодарочныхСертификатов.ПустаяСсылка") Тогда
		Форма.Элементы.СредствоОплаты.ПодсказкаВвода = НСтр("ru='<Все подарочные сертификаты>';uk='<Всі подарункові сертифікати>'");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьОписаниеСредстваОплаты(ЭтаФорма);
КонецПроцедуры
