#Область РаботаСXML

// Сформировать таблицу доп.реквизитов для фискальной строки документа
Функция СформироватьТаблицуДопРеквизитовФискСтроки(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
	
	ЗаписатьЭлемент(ЗаписьXML, "VAT", 				ДанныеЗагрузки.СтавкаНДССтрокой);              	//СтавкаНДССтрока
	ЗаписатьЭлемент(ЗаписьXML, "IsExcisable", 		ДанныеЗагрузки.ЭтоПодакцизныйТовар);   			//ЕстьАкциз
	ЗаписатьЭлемент(ЗаписьXML, "ExciseStampBarcode",ДанныеЗагрузки.ШтрихкодыАкцизныхМарок);	        //ШтрихкодыАкцизныхМарок   
	ЗаписатьЭлемент(ЗаписьXML, "UKTZED", 			ДанныеЗагрузки.КодПоУКТВЭД);	             	//УКТЗЕД   
	ЗаписатьЭлемент(ЗаписьXML, "VendorCode", 		ДанныеЗагрузки.Артикул);	             		//Артикул   
	ЗаписатьЭлемент(ЗаписьXML, "Barcode", 			ДанныеЗагрузки.Штрихкод);	             		//Штрихкод   
	ЗаписатьЭлемент(ЗаписьXML, "Discount", 			ДанныеЗагрузки.ПроцентСкидок);	             	//ПроцентСкидок   
	ЗаписатьЭлемент(ЗаписьXML, "DiscountAmount", 	ДанныеЗагрузки.СуммаСкидок);	             	//СуммаСкидок   
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
    	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции 

// Сформировать таблицу доп.реквизитов для фискальной строки документа
Функция СформироватьТаблицуДопРеквизитовФискЧека(ДанныеЗагрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗагрузки) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ДанныеЗагрузки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
	
	Для каждого КЗ ИЗ ДанныеЗагрузки Цикл
		ЗаписатьЭлемент(ЗаписьXML, КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
    	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции 

Процедура ЗаписатьЭлемент(ЗаписьXML, ИмяЭлемента, Значение)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
    ЗаписьXML.ЗаписатьТекст(XMLСтрока(Значение));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ПрочитатьXMLТаблицу(ТекстХМЛ) Экспорт
	
	Результат = Новый Структура;
	
	СтекУзлов = Новый Массив;
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ТекстХМЛ);
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			СтекУзлов.Добавить(Чтение.Имя);
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			СтекУзлов.Удалить(СтекУзлов.ВГраница());
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
			Если СтекУзлов.Количество() = 2 И СтекУзлов[0] = "Record" Тогда
				Результат.Вставить(СтекУзлов[1], Чтение.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

#КонецОбласти