#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка как Ссылка,
	|	ДанныеДокумента.Дата как Период,
	|	ДанныеДокумента.Организация КАК Организация
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
    |";
    
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
    
	Запрос.УстановитьПараметр("Период",         Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",    Реквизиты.Организация);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
    
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
    
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
    ТекстЗапросаТаблицаКонтролируемыеОперации(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаОбщиеСведенияОКонтролируемыхОперациях(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаКонтролируемыеОперации(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "КонтролируемыеОперации";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.ДокументИнформационнйБазы,
	|	КонтролируемыеСделки.ДоговорКонтрагента,
	|	КонтролируемыеСделки.КодНаименованияОперации,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.ХарактеристикаНоменклатуры,
	|	КонтролируемыеСделки.ПредметСделкиСтрока,
	|	КонтролируемыеСделки.КодПредмета,
	|	КонтролируемыеСделки.КодКлассификатораПродукцииИУслуг,
	|	КонтролируемыеСделки.КодУКТВЭД,
	|	КонтролируемыеСделки.КодУКВЭП,
	|	КонтролируемыеСделки.ДатаКонтракта,
	|	КонтролируемыеСделки.НомерКонтракта,
	|	КонтролируемыеСделки.КодСтороныОперации,
	|	КонтролируемыеСделки.КодСтраныПроисхождения,
	|	КонтролируемыеСделки.УсловиеПоставкиПоИнкотермс,
	|	КонтролируемыеСделки.МестоПоставкиПоИнкотермс,
	|	КонтролируемыеСделки.ТорговаяМарка,
	|	КонтролируемыеСделки.Производитель,
	|	КонтролируемыеСделки.ДатаОперацииС,
	|	КонтролируемыеСделки.ДатаОперацииПо,
	|	КонтролируемыеСделки.ЦенаВал,
	|	КонтролируемыеСделки.КоличествоУпаковок КАК Количество,
	|	КонтролируемыеСделки.КоличествоСогласноКонтракта,
	|	КонтролируемыеСделки.КодВалюты,
	|	КонтролируемыеСделки.КурсВалюты,
	|	КонтролируемыеСделки.СуммаРегл,
	|	КонтролируемыеСделки.ЦенаРегл,
	|	КонтролируемыеСделки.КодОснования,
	|	КонтролируемыеСделки.КодМетода,
	|	КонтролируемыеСделки.КодИсточника,
	|	КонтролируемыеСделки.ЦенаОбычнаяРегл,
	|	КонтролируемыеСделки.СуммаКорректировкиДоходов,
	|	КонтролируемыеСделки.СуммаКорректировкиРасходов,
	|	КонтролируемыеСделки.ПоказательРентабельности,
	|	КонтролируемыеСделки.ЗначениеПоказателяРентабельности,
	|	КонтролируемыеСделки.ПризнакГруппировкиВСовокупность,
	|	КонтролируемыеСделки.ИсследуемаяСторона,
	|	КонтролируемыеСделки.Упаковка,
    |	ВЫБОР КОГДА КонтролируемыеСделки.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
    |		КонтролируемыеСделки.ПредметСделки.ЕдиницаИзмерения.Код
    |	КОГДА КонтролируемыеСделки.Упаковка.Код = """" ТОГДА
    |		КонтролируемыеСделки.Упаковка.ЕдиницаИзмерения.Код
    |	ИНАЧЕ
    |		КонтролируемыеСделки.Упаковка.Код
    |	КОНЕЦ КАК КодЕдиницыИзмерения,
    |	ВЫБОР КОГДА КонтролируемыеСделки.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
    |		КонтролируемыеСделки.ПредметСделки.ЕдиницаИзмерения
    |	ИНАЧЕ
    |		КонтролируемыеСделки.Упаковка
    |	КОНЕЦ КАК ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтатусКонтрагента
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО НомерСтроки
	|";
	
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаОбщиеСведенияОКонтролируемыхОперациях(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "ОбщиеСведенияОКонтролируемыхОперациях";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = 
	"
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	КонтролируемыеСделки.Контрагент,
	|	СУММА(КонтролируемыеСделки.СуммаРегл) КАК СуммаКонтролируемыхОпераций,
	|	0 КАК СуммаОбщая
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&Организация,
	|	СуммыВсехОпераций.Контрагент,
	|	0,
	|	СУММА(СуммыВсехОпераций.СуммаОперацийЗаПериод)
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.СуммыВсехОпераций КАК СуммыВсехОпераций
	|ГДЕ
	|	СуммыВсехОпераций.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыВсехОпераций.Контрагент";
	
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСоздатьНаОсновании);
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандыСоздатьНаОснованииПисмаПоШаблону(КомандыСоздатьНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияИЗаполнение

Функция ЗаполнитьЗаПериод(Объект) Экспорт 
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьПоОстаткам

#КонецОбласти

#КонецОбласти

#КонецЕсли