#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Функция ПолноеИмяОбъекта()
	Возврат "РегистрНакопления.ПрочиеАктивыПассивы";
КонецФункции

Процедура ЗаполнитьСтатьиАктивовПассивовНалоги_КОбработке(Параметры) Экспорт
	
	ДополнительныеПараметрыОтметки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметрыОтметки.ЭтоДвижения = Истина;
	ДополнительныеПараметрыОтметки.ПолноеИмяРегистра = ПолноеИмяОбъекта();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПрочиеАктивыПассивы.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|ГДЕ
	|	(ПрочиеАктивыПассивы.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|)
	|	И (ПрочиеАктивыПассивы.Статья = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ИмущественныеНалоги)
	|		ИЛИ ПрочиеАктивыПассивы.Статья = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.НалогиИВзносыСОплатыТруда))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеАктивыПассивы.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ДанныеРегистра
	|
	|ГДЕ
	|	ДанныеРегистра.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|	И ВЫРАЗИТЬ(ДанныеРегистра.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).ХозяйственнаяОперация = &ПеречислениеНалога
	|	И ВЫРАЗИТЬ(ДанныеРегистра.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	И ДанныеРегистра.Статья = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|");
	
	Запрос.УстановитьПараметр("ПеречислениеНалога", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	
	ДанныеКОбработке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДанныеКОбработке, ДополнительныеПараметрыОтметки);
	
КонецПроцедуры

// Обработчик обновления BAS УТ 3.2.3
// Заполнение регистра после обновления.
// В регистре заменяются статьи активов и пассивов при начислении и оплате налогов на предопределенную статью "Налоги"
// Обработчик выполняется отложенно.
Процедура ЗаполнитьСтатьиАктивовПассивовНалоги(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.СписаниеБезналичныхДенежныхСредств");
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
		"РегистрНакопления.ПрочиеАктивыПассивы",
		Параметры.Очередь);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоАкцизу_ДанныеДляОбновления(Параметры) Экспорт
	
	ДополнительныеПараметрыОтметки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметрыОтметки.ЭтоДвижения = Истина;
	ДополнительныеПараметрыОтметки.ПолноеИмяРегистра = ПолноеИмяОбъекта();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ТаблицаТоваров
	|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО ТаблицаТоваров.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|   И ПрочиеАктивыПассивы.Статья = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)
	|   И ПрочиеАктивыПассивы.Аналитика = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.Акциз)
	|ГДЕ                       
	|   ТаблицаТоваров.Ссылка.Проведен 
	|	И ТаблицаТоваров.СтатьяДекларацииПоАкцизномуНалогу <> ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхДеклараций.ПустаяСсылка)
	|	И ТаблицаТоваров.СуммаАкцизногоНалога <> 0
	|   И ПрочиеАктивыПассивы.Регистратор ЕСТЬ NULL 
	|");
	
	ДанныеКОбработке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры, 
		ДанныеКОбработке, 
		ДополнительныеПараметрыОтметки
	);         
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.Товары КАК ТаблицаТоваров
	|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ПО ТаблицаТоваров.Ссылка = ПрочиеАктивыПассивы.Регистратор
	|   И ПрочиеАктивыПассивы.Статья = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)
	|   И ПрочиеАктивыПассивы.Аналитика = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.Акциз)
	|ГДЕ            
	|   ТаблицаТоваров.Ссылка.Проведен 
	|	И ТаблицаТоваров.Ссылка.СтатьяДекларацииПоАкцизномуНалогу <> ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхДеклараций.ПустаяСсылка)
	|	И ТаблицаТоваров.СуммаАкцизногоНалога <> 0
	|   И ПрочиеАктивыПассивы.Регистратор ЕСТЬ NULL 
	|");

	ДанныеКОбработке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры, 
		ДанныеКОбработке, 
		ДополнительныеПараметрыОтметки
	);         
    
КонецПроцедуры

Процедура СформироватьДвиженияПоАкцизу(Параметры) Экспорт
	
	ПолноеИмяРегистра = ПолноеИмяОбъекта();
	ИмяРегистра = СтрРазделить(ПолноеИмяРегистра, ".", Ложь)[1];
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(
	    Параметры.Очередь, 
	    Неопределено, 
	    ПолноеИмяРегистра
	);

	Пока Выборка.Следующий() Цикл
		
		Регистратор 		= Выборка.Регистратор;
        ИмяДокумента       	= Регистратор.Метаданные().Имя;
        ПолноеИмяДокумента 	= "Документ." + ИмяДокумента;
		
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяДокумента);
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();
			
			Набор = РегистрыНакопления.ПрочиеАктивыПассивы.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Регистратор);   
			Набор.Прочитать(); 
			ДопСвойства = Новый Структура;
			ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Регистратор, ДопСвойства);
			МенеджерДокумента.ИнициализироватьДанныеДокумента(Регистратор, ДопСвойства, ИмяРегистра);
			РезультатПроведения = ДопСвойства.ТаблицыДляДвижений[СтрШаблон("Таблица%1", ИмяРегистра)];
			
			Для Каждого СтрокаРезультатПроведения Из РезультатПроведения Цикл
				НоваяСтрока = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультатПроведения); 
				НоваяСтрока.Регистратор = Регистратор; 
				НоваяСтрока.Активность = Истина;
			КонецЦикла;        
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			ЗафиксироватьТранзакцию();   
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru='Не удалось обработать движения документа %Документ% по регистру ""Прочие активы и пассивы"". Причина: %Причина%';uk='Не вдалося обробити рухи документу %Документ% по регістру ""Інші активи та пасиви"". Причина: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Регистратор.Метаданные(), 
				Регистратор, 
				ТекстСообщения
			);
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(
	    Параметры.Очередь, 
	    ПолноеИмяРегистра
	);
	
КонецПроцедуры    

#КонецОбласти

#КонецОбласти

#КонецЕсли