
&НаКлиенте
Процедура ГруппаУчетаУдержанийПриИзменении(Элемент)
	УстановитьВидимостьИОчистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИОчистить()
	
	Если Запись.ГруппаУчетаУдержаний = ПредопределенноеЗначение("Справочник.ГруппыУчетаНачисленийИУдержаний.ЕСВ") Тогда
		Элементы.КодДохода.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.КодДохода) Тогда
			Запись.КодДохода = "";
		КонецЕсли;
		Элементы.Налог.Видимость = Истина;
		Элементы.ОбособленноеПодразделение.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.ОбособленноеПодразделение) Тогда
			Запись.ОбособленноеПодразделение = "";
		КонецЕсли;
	Иначе
		Элементы.Налог.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.Налог) Тогда
			Запись.Налог = "";
		КонецЕсли;
		Элементы.КодДохода.Видимость = Истина;
		Элементы.ОбособленноеПодразделение.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФункциональныеОпцииФормы()

	ПараметрыФО = Новый Структура("Организация", Запись.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИОчистить();
	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры
