//////////////////////////////////////////////////////////////////////////////////////////////
// УчетнаяПолитикаПереопределяемый: переопределяемый механизм отвечающий за получение данных учетной политики.
//  
//////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеПараметрыУчетнойПолитики

Функция Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт

	Возврат Истина;

КонецФункции

//++ НЕ УТ

Функция ПлательщикНалогаНаПрибыль(Организация, Период) Экспорт
	
	Результат = ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль", 
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));
	
	Возврат Результат;
	
КонецФункции 


Функция НалогНаПрибыльБезКорректировокФинансовогоРезультата(Организация, Период) Экспорт
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Ложь;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.НалогНаПрибыльБезКорректировокФинансовогоРезультата;
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции 

Функция ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли(Организация, Период) Экспорт
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Ложь;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли;
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции 

//-- НЕ УТ

Функция СистемаНалогообложения(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, Период);
	СистемаНалогообложения = ПараметрыУчетнойПолитики.СистемаНалогообложения;
	Возврат СистемаНалогообложения;

КонецФункции

Функция СистемаНалогообложенияУказываетсяСТочностьюДоДня(ЭлементУчетнойПолитики) Экспорт
	
	Возврат (ЭлементУчетнойПолитики.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйНалог
		ИЛИ ЭлементУчетнойПолитики.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйНалогИНДС)
		И ЭлементУчетнойПолитики.ГруппаПлательщикаЕдиногоНалога = Перечисления.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая;
	
КонецФункции
	
Процедура ПреобразоватьЗаписьУчетнойПолитикиПередЗаписью(УчетнаяПолитикаЗапись, ИзменениеПериода = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики)
		ИЛИ НЕ СистемаНалогообложенияУказываетсяСТочностьюДоДня(УчетнаяПолитикаЗапись.УчетнаяПолитика) Тогда
		
		УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики = УчетнаяПолитикаЗапись.Период;
		
	Иначе
		
		ПериодСоответствующийДатеИзмененияПолитики = НачалоМесяца(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики);
		
		Если УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики <> НачалоМесяца(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики) Тогда
			ПериодСоответствующийДатеИзмененияПолитики = ДобавитьМесяц(ПериодСоответствующийДатеИзмененияПолитики, 1);
		КонецЕсли;				
		
		Если УчетнаяПолитикаЗапись.Период <> ПериодСоответствующийДатеИзмененияПолитики Тогда
			Если ИзменениеПериода Тогда
				УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики = УчетнаяПолитикаЗапись.Период;
			Иначе
				УчетнаяПолитикаЗапись.Период = ПериодСоответствующийДатеИзмененияПолитики;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПараметрыУчетнойПолитикиПоНДС

// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период) Экспорт

	Возврат Справочники.Организации.ПлательщикНДС(Организация, Период);

КонецФункции 



#КонецОбласти

//++ НЕ УТ
#Область ПараметрыУчетнойПолитикиБухучет

Функция ИспользуемыеКлассыСчетовРасходов(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Перечисления.КлассыСчетовРасходов.Класс9;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.ИспользуемыеКлассыСчетовРасходов;
	КонецЕсли; 

	Возврат Результат;

КонецФункции 


#КонецОбласти
//-- НЕ УТ



// Параметры учетной политики по производству

//++ НЕ УТ



//-- НЕ УТ

#КонецОбласти