
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если МассивИсключаемыхЗначений.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
			"ТипыНалогов",
			ДанныеВыбора,
			Параметры,
			МассивИсключаемыхЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Функция возвращает типа налога в зависимости от операции по зарплате.
//
// Параметры:
//   ВидОперации - Перечисление.ВидыОперацийПоЗарплате - вид операции по зарплате
//
// Возвращаемое значение:
//   ТипНалога  -  Перечисление "Типы налогов"
// 
Функция ТипНалогаОперацииПоЗарплаты(ВидОперации) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛ Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛ;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоначисленныйПоРезультатамПроверки Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоначисленныйПоРезультатамПроверки;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛДоходыКонтрагентов Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПередачаЗадолженностиВНалоговыйОрган Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛПередачаЗадолженностиВНалоговыйОрган;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛПрочиеРасчетыСПерсоналом Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛПрочиеРасчетыСПерсоналом;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НДФЛРасчетыСБывшимиСотрудниками Тогда
		ТипНалога = Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов;
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивиденды Тогда
        ТипНалога = Перечисления.ТипыНалогов.НФДЛДивиденды;
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НФДЛДивидендыСотрудникам Тогда
        ТипНалога = Перечисления.ТипыНалогов.НФДЛДивидендыСотрудникам;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВоенныйСбор Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВСДоходыКонтрагентов Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ВСРасчетыСБывшимиСотрудниками Тогда
		ТипНалога = Перечисления.ТипыНалогов.ВоенныйСбор;	
	КонецЕсли;
	
	Возврат ТипНалога;
	
КонецФункции
//-- НЕ УТ